In [1]:
#csv and panda

In [2]:
#csv      #comma sepreated values

In [4]:
s = str()                                       
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    phone = input("Enter phone = ")
    
    s = s+f"{name},{phone}\n"                    
print(s)

b=open('phone.csv','a')                
b.write(s)
b.close()

Enter n = 2
Enter name = hari
Enter phone = 646464
Enter name = ram
Enter phone = 464
hari,646464
ram,464

In [2]:
s = str()                                      
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = input("Enter phone = ")
    address=input("enter address")
    s = s+f"{name},{age},{address}\n"                    
print(s)

b=open('bio.txt','a')                
b.write(s)
b.close()

Enter n = 2
Enter name = bharat
Enter phone = 33333
enter addressdamak, jhapa
Enter name = alin
Enter phone = 5555
enter addresslalitpur
bharat,33333,damak, jhapa
alin,5555,lalitpur

In [ ]:
s = str()                                       #to add data on the same txt file
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    phone = input("Enter phone = ")
    
    s = s+f"{name} {phone}\n"                    #can be use this formula insted of s = s+name+"--"+phone+"\n"
print(s)

b=open('phone.txt','a')                
b.write(s)
b.close()

Enter n = 6
Enter name = hari
Enter phone = 55565655

In [1]:
s = str()                                      
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = input("Enter phone = ")
    address=input("enter address")
    s = s+f"{name},{age},{address}\n"                    
print(s)

b=open('bio.csv','a')                
b.write(s)
b.close()

Enter n = 6
Enter name = alin
Enter phone = 7777
enter addressdamak
Enter name = hari
Enter phone = 88888
enter addressmorang
Enter name = ram
Enter phone = 99999
enter addresssarlahai
Enter name = bharat
Enter phone = 44444
enter addressdharan
Enter name = shyam
Enter phone = 555555
enter addressilam
Enter name = gita
Enter phone = 66666
enter addresstaplajung
alin,7777,damak
hari,88888,morang
ram,99999,sarlahai
bharat,44444,dharan
shyam,555555,ilam
gita,66666,taplajung

In [2]:
!pip install pandas

#import panda pd

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: numpy>=1.17.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [1]:
import pandas as pd                             #to add data using panda before this process we have to add data using note pad
                                                #after adding data save and run this process
df=pd.read_csv('bio.csv')
df

     Name   phone    address
0    alin    7777      damak
1    hari   88888     morang
2     ram   99999   sarlahai
3  bharat   44444     dharan
4   shyam  555555       ilam
5    gita   66666  taplajung

In [2]:
import pandas as pd                             #to add data using panda before this process we have to add data using note pad
                                                #after adding data save and run this process
df=pd.read_csv('bio.csv')
df

   S.N    Name   phone    address
0    1    alin    7777      damak
1    2    hari   88888     morang
2    3     ram   99999   sarlahai
3    4  bharat   44444     dharan
4    5   shyam  555555       ilam
5    6    gita   66666  taplajung

In [3]:
import pandas as pd                             #to add data using panda before this process we have to add data using note pad
                                                #after adding data save and run this process
df=pd.read_csv('bio.csv',nrows=5)
df

   S.N    Name   phone   address
0    1    alin    7777     damak
1    2    hari   88888    morang
2    3     ram   99999  sarlahai
3    4  bharat   44444    dharan
4    5   shyam  555555      ilam

In [4]:
import pandas as pd                             #to add data using panda before this process we have to add data using note pad
                                                #after adding data save and run this process
df=pd.read_csv('bio.csv',nrows=5,index_col="S.N")
df

       Name   phone   address
S.N
1      alin    7777     damak
2      hari   88888    morang
3       ram   99999  sarlahai
4    bharat   44444    dharan
5     shyam  555555      ilam

In [5]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df

       Name   phone    address
S.N
1      alin    7777      damak
2      hari   88888     morang
3       ram   99999   sarlahai
4    bharat   44444     dharan
5     shyam  555555       ilam
6      gita   66666  taplajung

In [6]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df.head(4)

       Name  phone   address
S.N
1      alin   7777     damak
2      hari  88888    morang
3       ram  99999  sarlahai
4    bharat  44444    dharan

In [7]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df.tail(3)

       Name   phone    address
S.N
4    bharat   44444     dharan
5     shyam  555555       ilam
6      gita   66666  taplajung

In [17]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df.head(5)

       Name   phone   address
S.N
1      alin    7777     damak
2      hari   88888    morang
3       ram   99999  sarlahai
4    bharat   44444    dharan
5     shyam  555555      ilam

In [18]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="Name",usecols=['S.N','Name','address'])
df.iloc[5:2]

Empty DataFrame
Columns: [S.N, address]
Index: []

In [11]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N",usecols=['S.N','Name','address'])
df.head(3)

     Name   address
S.N
1    alin     damak
2    hari    morang
3     ram  sarlahai

In [16]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N",usecols=['S.N','Name','address'])
df.iloc[2:4]

       Name   address
S.N
3       ram  sarlahai
4    bharat    dharan

In [14]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="Name",usecols=['S.N','Name','address'])
df.loc[2:5]

       Name   address
S.N
2      hari    morang
3       ram  sarlahai
4    bharat    dharan
5     shyam      ilam

In [15]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="Name")
df.loc["ram":"shyam"]

        S.N   phone   address
Name
ram       3   99999  sarlahai
bharat    4   44444    dharan
shyam     5  555555      ilam

In [1]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df

       Name   phone    address
S.N
1      alin    7777      damak
2      hari   88888     morang
3       ram   99999   sarlahai
4    bharat   44444     dharan
5     shyam  555555       ilam
6      gita   66666  taplajung

In [3]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df['address']

S.N
1        damak
2       morang
3     sarlahai
4       dharan
5         ilam
6    taplajung
Name: address, dtype: object

In [4]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df[df['address']=="damak"]

     Name  phone address
S.N
1    alin   7777   damak

In [8]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df=df[df['address']=="dharan"]
data.to_csv('new_file.csv')

NameError: name 'data' is not defined

In [12]:
import pandas as pd                             
                                                
df=pd.read_csv('bio.csv',nrows=6,index_col="S.N")
df.[df['phone']|(df['address']==ilam)]

SyntaxError: invalid syntax (Temp/ipykernel_4660/4246412228.py, line 4)

In [15]:
import pandas as pd
data={'sn':[1,2,3],
    'name':["hari","ram","sita"],
    'address':["kathmandu","bhaktapur","kirtipur"]}
    
df=pd.dataframe(data)
df.to_csv('dataframe.csv')
df

AttributeError: module 'pandas' has no attribute 'dataframe'

In [16]:
import csv
fieldds=[4,"alin","jhapa"]
with open('dataframe.csv','a') as f:
    x=csv.writer(f)
    x.writerow(fields)

NameError: name 'fields' is not defined

In [4]:
import csv
data=[["sn","name","address"],
     [1,"kamal","baluwatar"],
     [2,"sabin","koteshwor"],
     [3,"subash","patan"]]

f= open('datas.csv','w')
x= csv.writer(f)
for i in data:
    x.writerow(i)
f.close()